espressif/esp-idf/components/soc/esp32s3/include/soc/spi_reg.h
#define SPI_DIN_MODE_REG(i)          (REG_SPI_BASE(i) + 0x24)
/* SPI_TIMING_HCLK_ACTIVE : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: 1:enable hclk in SPI input timing module.  0: disable it. Can be configured in C
ONF state..*/
#define SPI_TIMING_HCLK_ACTIVE    (BIT(16))
#define SPI_TIMING_HCLK_ACTIVE_M  (BIT(16))
#define SPI_TIMING_HCLK_ACTIVE_V  0x1
#define SPI_TIMING_HCLK_ACTIVE_S  16
/* SPI_DIN7_MODE : R/W ;bitpos:[15:14] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: input without delay
ed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3:
 input with the spi_clk. Can be configured in CONF state..*/
#define SPI_DIN7_MODE    0x00000003
#define SPI_DIN7_MODE_M  ((SPI_DIN7_MODE_V)<<(SPI_DIN7_MODE_S))
#define SPI_DIN7_MODE_V  0x3
#define SPI_DIN7_MODE_S  14
/* SPI_DIN6_MODE : R/W ;bitpos:[13:12] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: input without delay
ed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3:
 input with the spi_clk. Can be configured in CONF state..*/
#define SPI_DIN6_MODE    0x00000003
#define SPI_DIN6_MODE_M  ((SPI_DIN6_MODE_V)<<(SPI_DIN6_MODE_S))
#define SPI_DIN6_MODE_V  0x3
#define SPI_DIN6_MODE_S  12
/* SPI_DIN5_MODE : R/W ;bitpos:[11:10] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: input without delay
ed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3:
 input with the spi_clk. Can be configured in CONF state..*/
#define SPI_DIN5_MODE    0x00000003
#define SPI_DIN5_MODE_M  ((SPI_DIN5_MODE_V)<<(SPI_DIN5_MODE_S))
#define SPI_DIN5_MODE_V  0x3
#define SPI_DIN5_MODE_S  10
/* SPI_DIN4_MODE : R/W ;bitpos:[9:8] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: input without delay
ed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3:
 input with the spi_clk. Can be configured in CONF state..*/
#define SPI_DIN4_MODE    0x00000003
#define SPI_DIN4_MODE_M  ((SPI_DIN4_MODE_V)<<(SPI_DIN4_MODE_S))
#define SPI_DIN4_MODE_V  0x3
#define SPI_DIN4_MODE_S  8
/* SPI_DIN3_MODE : R/W ;bitpos:[7:6] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: input without delay
ed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3:
 input with the spi_clk. Can be configured in CONF state..*/
#define SPI_DIN3_MODE    0x00000003
#define SPI_DIN3_MODE_M  ((SPI_DIN3_MODE_V)<<(SPI_DIN3_MODE_S))
#define SPI_DIN3_MODE_V  0x3
#define SPI_DIN3_MODE_S  6
/* SPI_DIN2_MODE : R/W ;bitpos:[5:4] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: input without delay
ed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3:
 input with the spi_clk. Can be configured in CONF state..*/
#define SPI_DIN2_MODE    0x00000003
#define SPI_DIN2_MODE_M  ((SPI_DIN2_MODE_V)<<(SPI_DIN2_MODE_S))
#define SPI_DIN2_MODE_V  0x3
#define SPI_DIN2_MODE_S  4
/* SPI_DIN1_MODE : R/W ;bitpos:[3:2] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: input without delay
ed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3:
 input with the spi_clk. Can be configured in CONF state..*/
#define SPI_DIN1_MODE    0x00000003
#define SPI_DIN1_MODE_M  ((SPI_DIN1_MODE_V)<<(SPI_DIN1_MODE_S))
#define SPI_DIN1_MODE_V  0x3
#define SPI_DIN1_MODE_S  2
/* SPI_DIN0_MODE : R/W ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: input without delay
ed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3:
 input with the spi_clk. Can be configured in CONF state..*/
#define SPI_DIN0_MODE    0x00000003
#define SPI_DIN0_MODE_M  ((SPI_DIN0_MODE_V)<<(SPI_DIN0_MODE_S))
#define SPI_DIN0_MODE_V  0x3
#define SPI_DIN0_MODE_S  0

#define SPI_DIN_NUM_REG(i)          (REG_SPI_BASE(i) + 0x28)
/* SPI_DIN7_NUM : R/W ;bitpos:[15:14] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle,
 1: delayed by 2 cycles,...  Can be configured in CONF state..*/
#define SPI_DIN7_NUM    0x00000003
#define SPI_DIN7_NUM_M  ((SPI_DIN7_NUM_V)<<(SPI_DIN7_NUM_S))
#define SPI_DIN7_NUM_V  0x3
#define SPI_DIN7_NUM_S  14
/* SPI_DIN6_NUM : R/W ;bitpos:[13:12] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle,
 1: delayed by 2 cycles,...  Can be configured in CONF state..*/
#define SPI_DIN6_NUM    0x00000003
#define SPI_DIN6_NUM_M  ((SPI_DIN6_NUM_V)<<(SPI_DIN6_NUM_S))
#define SPI_DIN6_NUM_V  0x3
#define SPI_DIN6_NUM_S  12
/* SPI_DIN5_NUM : R/W ;bitpos:[11:10] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle,
 1: delayed by 2 cycles,...  Can be configured in CONF state..*/
#define SPI_DIN5_NUM    0x00000003
#define SPI_DIN5_NUM_M  ((SPI_DIN5_NUM_V)<<(SPI_DIN5_NUM_S))
#define SPI_DIN5_NUM_V  0x3
#define SPI_DIN5_NUM_S  10
/* SPI_DIN4_NUM : R/W ;bitpos:[9:8] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle,
 1: delayed by 2 cycles,...  Can be configured in CONF state..*/
#define SPI_DIN4_NUM    0x00000003
#define SPI_DIN4_NUM_M  ((SPI_DIN4_NUM_V)<<(SPI_DIN4_NUM_S))
#define SPI_DIN4_NUM_V  0x3
#define SPI_DIN4_NUM_S  8
/* SPI_DIN3_NUM : R/W ;bitpos:[7:6] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle,
 1: delayed by 2 cycles,...  Can be configured in CONF state..*/
#define SPI_DIN3_NUM    0x00000003
#define SPI_DIN3_NUM_M  ((SPI_DIN3_NUM_V)<<(SPI_DIN3_NUM_S))
#define SPI_DIN3_NUM_V  0x3
#define SPI_DIN3_NUM_S  6
/* SPI_DIN2_NUM : R/W ;bitpos:[5:4] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle,
 1: delayed by 2 cycles,...  Can be configured in CONF state..*/
#define SPI_DIN2_NUM    0x00000003
#define SPI_DIN2_NUM_M  ((SPI_DIN2_NUM_V)<<(SPI_DIN2_NUM_S))
#define SPI_DIN2_NUM_V  0x3
#define SPI_DIN2_NUM_S  4
/* SPI_DIN1_NUM : R/W ;bitpos:[3:2] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle,
 1: delayed by 2 cycles,...  Can be configured in CONF state..*/
#define SPI_DIN1_NUM    0x00000003
#define SPI_DIN1_NUM_M  ((SPI_DIN1_NUM_V)<<(SPI_DIN1_NUM_S))
#define SPI_DIN1_NUM_V  0x3
#define SPI_DIN1_NUM_S  2
/* SPI_DIN0_NUM : R/W ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle,
 1: delayed by 2 cycles,...  Can be configured in CONF state..*/
#define SPI_DIN0_NUM    0x00000003
#define SPI_DIN0_NUM_M  ((SPI_DIN0_NUM_V)<<(SPI_DIN0_NUM_S))
#define SPI_DIN0_NUM_V  0x3
#define SPI_DIN0_NUM_S  0

