espressif/esp-idf/components/soc/esp32s3/include/soc/spi_reg.h
#define SPI_DOUT_MODE_REG(i)          (REG_SPI_BASE(i) + 0x2C)
/* SPI_D_DQS_MODE : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The output signal SPI_DQS is delayed by the SPI module clock, 0: output without
delayed, 1: output delay for a SPI module clock cycle at its negative edge. Can
be configured in CONF state..*/
#define SPI_D_DQS_MODE    (BIT(8))
#define SPI_D_DQS_MODE_M  (BIT(8))
#define SPI_D_DQS_MODE_V  0x1
#define SPI_D_DQS_MODE_S  8
/* SPI_DOUT7_MODE : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The output signal $n is delayed by the SPI module clock, 0: output without delay
ed, 1: output delay for a SPI module clock cycle at its negative edge. Can be co
nfigured in CONF state..*/
#define SPI_DOUT7_MODE    (BIT(7))
#define SPI_DOUT7_MODE_M  (BIT(7))
#define SPI_DOUT7_MODE_V  0x1
#define SPI_DOUT7_MODE_S  7
/* SPI_DOUT6_MODE : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The output signal $n is delayed by the SPI module clock, 0: output without delay
ed, 1: output delay for a SPI module clock cycle at its negative edge. Can be co
nfigured in CONF state..*/
#define SPI_DOUT6_MODE    (BIT(6))
#define SPI_DOUT6_MODE_M  (BIT(6))
#define SPI_DOUT6_MODE_V  0x1
#define SPI_DOUT6_MODE_S  6
/* SPI_DOUT5_MODE : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The output signal $n is delayed by the SPI module clock, 0: output without delay
ed, 1: output delay for a SPI module clock cycle at its negative edge. Can be co
nfigured in CONF state..*/
#define SPI_DOUT5_MODE    (BIT(5))
#define SPI_DOUT5_MODE_M  (BIT(5))
#define SPI_DOUT5_MODE_V  0x1
#define SPI_DOUT5_MODE_S  5
/* SPI_DOUT4_MODE : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The output signal $n is delayed by the SPI module clock, 0: output without delay
ed, 1: output delay for a SPI module clock cycle at its negative edge. Can be co
nfigured in CONF state..*/
#define SPI_DOUT4_MODE    (BIT(4))
#define SPI_DOUT4_MODE_M  (BIT(4))
#define SPI_DOUT4_MODE_V  0x1
#define SPI_DOUT4_MODE_S  4
/* SPI_DOUT3_MODE : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The output signal $n is delayed by the SPI module clock, 0: output without delay
ed, 1: output delay for a SPI module clock cycle at its negative edge. Can be co
nfigured in CONF state..*/
#define SPI_DOUT3_MODE    (BIT(3))
#define SPI_DOUT3_MODE_M  (BIT(3))
#define SPI_DOUT3_MODE_V  0x1
#define SPI_DOUT3_MODE_S  3
/* SPI_DOUT2_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The output signal $n is delayed by the SPI module clock, 0: output without delay
ed, 1: output delay for a SPI module clock cycle at its negative edge. Can be co
nfigured in CONF state..*/
#define SPI_DOUT2_MODE    (BIT(2))
#define SPI_DOUT2_MODE_M  (BIT(2))
#define SPI_DOUT2_MODE_V  0x1
#define SPI_DOUT2_MODE_S  2
/* SPI_DOUT1_MODE : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The output signal $n is delayed by the SPI module clock, 0: output without delay
ed, 1: output delay for a SPI module clock cycle at its negative edge. Can be co
nfigured in CONF state..*/
#define SPI_DOUT1_MODE    (BIT(1))
#define SPI_DOUT1_MODE_M  (BIT(1))
#define SPI_DOUT1_MODE_V  0x1
#define SPI_DOUT1_MODE_S  1
/* SPI_DOUT0_MODE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The output signal $n is delayed by the SPI module clock, 0: output without delay
ed, 1: output delay for a SPI module clock cycle at its negative edge. Can be co
nfigured in CONF state..*/
#define SPI_DOUT0_MODE    (BIT(0))
#define SPI_DOUT0_MODE_M  (BIT(0))
#define SPI_DOUT0_MODE_V  0x1
#define SPI_DOUT0_MODE_S  0

#define SPI_DMA_CONF_REG(i)          (REG_SPI_BASE(i) + 0x30)
/* SPI_DMA_AFIFO_RST : WT ;bitpos:[31] ;default: 1'b0 ; */
/*description: Set this bit to reset DMA TX AFIFO, which is used to send data out in SPI slave
DMA controlled mode transfer..*/
#define SPI_DMA_AFIFO_RST    (BIT(31))
#define SPI_DMA_AFIFO_RST_M  (BIT(31))
#define SPI_DMA_AFIFO_RST_V  0x1
#define SPI_DMA_AFIFO_RST_S  31
/* SPI_BUF_AFIFO_RST : WT ;bitpos:[30] ;default: 1'b0 ; */
/*description: Set this bit to reset BUF TX AFIFO, which is used send data out in SPI slave CPU
 controlled mode transfer and master mode transfer..*/
#define SPI_BUF_AFIFO_RST    (BIT(30))
#define SPI_BUF_AFIFO_RST_M  (BIT(30))
#define SPI_BUF_AFIFO_RST_V  0x1
#define SPI_BUF_AFIFO_RST_S  30
/* SPI_RX_AFIFO_RST : WT ;bitpos:[29] ;default: 1'b0 ; */
/*description: Set this bit to reset RX AFIFO, which is used to receive data in SPI master and
slave mode transfer..*/
#define SPI_RX_AFIFO_RST    (BIT(29))
#define SPI_RX_AFIFO_RST_M  (BIT(29))
#define SPI_RX_AFIFO_RST_V  0x1
#define SPI_RX_AFIFO_RST_S  29
/* SPI_DMA_TX_ENA : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: Set this bit to enable SPI DMA controlled send data mode..*/
#define SPI_DMA_TX_ENA    (BIT(28))
#define SPI_DMA_TX_ENA_M  (BIT(28))
#define SPI_DMA_TX_ENA_V  0x1
#define SPI_DMA_TX_ENA_S  28
/* SPI_DMA_RX_ENA : R/W ;bitpos:[27] ;default: 1'd0 ; */
/*description: Set this bit to enable SPI DMA controlled receive data mode..*/
#define SPI_DMA_RX_ENA    (BIT(27))
#define SPI_DMA_RX_ENA_M  (BIT(27))
#define SPI_DMA_RX_ENA_V  0x1
#define SPI_DMA_RX_ENA_S  27
/* SPI_RX_EOF_EN : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: 1: spi_dma_inlink_eof is set when the number of dma pushed data bytes is equal t
o the value of spi_slv/mst_dma_rd_bytelen[19:0] in spi dma transition.  0: spi_d
ma_inlink_eof is set by spi_trans_done in non-seg-trans or spi_dma_seg_trans_don
e in seg-trans..*/
#define SPI_RX_EOF_EN    (BIT(21))
#define SPI_RX_EOF_EN_M  (BIT(21))
#define SPI_RX_EOF_EN_V  0x1
#define SPI_RX_EOF_EN_S  21
/* SPI_SLV_TX_SEG_TRANS_CLR_EN : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: 1: spi_dma_outfifo_empty_vld is cleared by spi slave cmd 6. 0: spi_dma_outfifo_e
mpty_vld is cleared by spi_trans_done..*/
#define SPI_SLV_TX_SEG_TRANS_CLR_EN    (BIT(20))
#define SPI_SLV_TX_SEG_TRANS_CLR_EN_M  (BIT(20))
#define SPI_SLV_TX_SEG_TRANS_CLR_EN_V  0x1
#define SPI_SLV_TX_SEG_TRANS_CLR_EN_S  20
/* SPI_SLV_RX_SEG_TRANS_CLR_EN : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: 1: spi_dma_infifo_full_vld is cleared by spi slave cmd 5. 0: spi_dma_infifo_full
_vld is cleared by spi_trans_done..*/
#define SPI_SLV_RX_SEG_TRANS_CLR_EN    (BIT(19))
#define SPI_SLV_RX_SEG_TRANS_CLR_EN_M  (BIT(19))
#define SPI_SLV_RX_SEG_TRANS_CLR_EN_V  0x1
#define SPI_SLV_RX_SEG_TRANS_CLR_EN_S  19
/* SPI_DMA_SLV_SEG_TRANS_EN : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: Enable dma segment transfer in spi dma half slave mode. 1: enable. 0: disable..*/
#define SPI_DMA_SLV_SEG_TRANS_EN    (BIT(18))
#define SPI_DMA_SLV_SEG_TRANS_EN_M  (BIT(18))
#define SPI_DMA_SLV_SEG_TRANS_EN_V  0x1
#define SPI_DMA_SLV_SEG_TRANS_EN_S  18
/* SPI_DMA_INFIFO_FULL : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: Records the status of DMA RX FIFO. 1: DMA RX FIFO is not ready for receiving dat
a. 0: DMA RX FIFO is ready for receiving data..*/
#define SPI_DMA_INFIFO_FULL    (BIT(1))
#define SPI_DMA_INFIFO_FULL_M  (BIT(1))
#define SPI_DMA_INFIFO_FULL_V  0x1
#define SPI_DMA_INFIFO_FULL_S  1
/* SPI_DMA_OUTFIFO_EMPTY : RO ;bitpos:[0] ;default: 1'b1 ; */
/*description: Records the status of DMA TX FIFO. 1: DMA TX FIFO is not ready for sending data.
 0: DMA TX FIFO is ready for sending data..*/
#define SPI_DMA_OUTFIFO_EMPTY    (BIT(0))
#define SPI_DMA_OUTFIFO_EMPTY_M  (BIT(0))
#define SPI_DMA_OUTFIFO_EMPTY_V  0x1
#define SPI_DMA_OUTFIFO_EMPTY_S  0

#define SPI_DMA_INT_ENA_REG(i)          (REG_SPI_BASE(i) + 0x34)
/* SPI_APP1_INT_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: The enable bit for SPI_APP1_INT interrupt..*/
#define SPI_APP1_INT_ENA    (BIT(20))
#define SPI_APP1_INT_ENA_M  (BIT(20))
#define SPI_APP1_INT_ENA_V  0x1
#define SPI_APP1_INT_ENA_S  20
/* SPI_APP2_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: The enable bit for SPI_APP2_INT interrupt..*/
#define SPI_APP2_INT_ENA    (BIT(19))
#define SPI_APP2_INT_ENA_M  (BIT(19))
#define SPI_APP2_INT_ENA_V  0x1
#define SPI_APP2_INT_ENA_S  19
/* SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt..*/
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ENA    (BIT(18))
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ENA_M  (BIT(18))
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ENA_V  0x1
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ENA_S  18
/* SPI_MST_RX_AFIFO_WFULL_ERR_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt..*/
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_ENA    (BIT(17))
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_ENA_M  (BIT(17))
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_ENA_V  0x1
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_ENA_S  17
/* SPI_SLV_CMD_ERR_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: The enable bit for SPI_SLV_CMD_ERR_INT interrupt..*/
#define SPI_SLV_CMD_ERR_INT_ENA    (BIT(16))
#define SPI_SLV_CMD_ERR_INT_ENA_M  (BIT(16))
#define SPI_SLV_CMD_ERR_INT_ENA_V  0x1
#define SPI_SLV_CMD_ERR_INT_ENA_S  16
/* SPI_SLV_BUF_ADDR_ERR_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: The enable bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt..*/
#define SPI_SLV_BUF_ADDR_ERR_INT_ENA    (BIT(15))
#define SPI_SLV_BUF_ADDR_ERR_INT_ENA_M  (BIT(15))
#define SPI_SLV_BUF_ADDR_ERR_INT_ENA_V  0x1
#define SPI_SLV_BUF_ADDR_ERR_INT_ENA_S  15
/* SPI_SEG_MAGIC_ERR_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: The enable bit for SPI_SEG_MAGIC_ERR_INT interrupt..*/
#define SPI_SEG_MAGIC_ERR_INT_ENA    (BIT(14))
#define SPI_SEG_MAGIC_ERR_INT_ENA_M  (BIT(14))
#define SPI_SEG_MAGIC_ERR_INT_ENA_V  0x1
#define SPI_SEG_MAGIC_ERR_INT_ENA_S  14
/* SPI_DMA_SEG_TRANS_DONE_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: The enable bit for SPI_DMA_SEG_TRANS_DONE_INT interrupt..*/
#define SPI_DMA_SEG_TRANS_DONE_INT_ENA    (BIT(13))
#define SPI_DMA_SEG_TRANS_DONE_INT_ENA_M  (BIT(13))
#define SPI_DMA_SEG_TRANS_DONE_INT_ENA_V  0x1
#define SPI_DMA_SEG_TRANS_DONE_INT_ENA_S  13
/* SPI_TRANS_DONE_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: The enable bit for SPI_TRANS_DONE_INT interrupt..*/
#define SPI_TRANS_DONE_INT_ENA    (BIT(12))
#define SPI_TRANS_DONE_INT_ENA_M  (BIT(12))
#define SPI_TRANS_DONE_INT_ENA_V  0x1
#define SPI_TRANS_DONE_INT_ENA_S  12
/* SPI_SLV_WR_BUF_DONE_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: The enable bit for SPI_SLV_WR_BUF_DONE_INT interrupt..*/
#define SPI_SLV_WR_BUF_DONE_INT_ENA    (BIT(11))
#define SPI_SLV_WR_BUF_DONE_INT_ENA_M  (BIT(11))
#define SPI_SLV_WR_BUF_DONE_INT_ENA_V  0x1
#define SPI_SLV_WR_BUF_DONE_INT_ENA_S  11
/* SPI_SLV_RD_BUF_DONE_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: The enable bit for SPI_SLV_RD_BUF_DONE_INT interrupt..*/
#define SPI_SLV_RD_BUF_DONE_INT_ENA    (BIT(10))
#define SPI_SLV_RD_BUF_DONE_INT_ENA_M  (BIT(10))
#define SPI_SLV_RD_BUF_DONE_INT_ENA_V  0x1
#define SPI_SLV_RD_BUF_DONE_INT_ENA_S  10
/* SPI_SLV_WR_DMA_DONE_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The enable bit for SPI_SLV_WR_DMA_DONE_INT interrupt..*/
#define SPI_SLV_WR_DMA_DONE_INT_ENA    (BIT(9))
#define SPI_SLV_WR_DMA_DONE_INT_ENA_M  (BIT(9))
#define SPI_SLV_WR_DMA_DONE_INT_ENA_V  0x1
#define SPI_SLV_WR_DMA_DONE_INT_ENA_S  9
/* SPI_SLV_RD_DMA_DONE_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The enable bit for SPI_SLV_RD_DMA_DONE_INT interrupt..*/
#define SPI_SLV_RD_DMA_DONE_INT_ENA    (BIT(8))
#define SPI_SLV_RD_DMA_DONE_INT_ENA_M  (BIT(8))
#define SPI_SLV_RD_DMA_DONE_INT_ENA_V  0x1
#define SPI_SLV_RD_DMA_DONE_INT_ENA_S  8
/* SPI_SLV_CMDA_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The enable bit for SPI slave CMDA interrupt..*/
#define SPI_SLV_CMDA_INT_ENA    (BIT(7))
#define SPI_SLV_CMDA_INT_ENA_M  (BIT(7))
#define SPI_SLV_CMDA_INT_ENA_V  0x1
#define SPI_SLV_CMDA_INT_ENA_S  7
/* SPI_SLV_CMD9_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The enable bit for SPI slave CMD9 interrupt..*/
#define SPI_SLV_CMD9_INT_ENA    (BIT(6))
#define SPI_SLV_CMD9_INT_ENA_M  (BIT(6))
#define SPI_SLV_CMD9_INT_ENA_V  0x1
#define SPI_SLV_CMD9_INT_ENA_S  6
/* SPI_SLV_CMD8_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The enable bit for SPI slave CMD8 interrupt..*/
#define SPI_SLV_CMD8_INT_ENA    (BIT(5))
#define SPI_SLV_CMD8_INT_ENA_M  (BIT(5))
#define SPI_SLV_CMD8_INT_ENA_V  0x1
#define SPI_SLV_CMD8_INT_ENA_S  5
/* SPI_SLV_CMD7_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The enable bit for SPI slave CMD7 interrupt..*/
#define SPI_SLV_CMD7_INT_ENA    (BIT(4))
#define SPI_SLV_CMD7_INT_ENA_M  (BIT(4))
#define SPI_SLV_CMD7_INT_ENA_V  0x1
#define SPI_SLV_CMD7_INT_ENA_S  4
/* SPI_SLV_EN_QPI_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The enable bit for SPI slave En_QPI interrupt..*/
#define SPI_SLV_EN_QPI_INT_ENA    (BIT(3))
#define SPI_SLV_EN_QPI_INT_ENA_M  (BIT(3))
#define SPI_SLV_EN_QPI_INT_ENA_V  0x1
#define SPI_SLV_EN_QPI_INT_ENA_S  3
/* SPI_SLV_EX_QPI_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The enable bit for SPI slave Ex_QPI interrupt..*/
#define SPI_SLV_EX_QPI_INT_ENA    (BIT(2))
#define SPI_SLV_EX_QPI_INT_ENA_M  (BIT(2))
#define SPI_SLV_EX_QPI_INT_ENA_V  0x1
#define SPI_SLV_EX_QPI_INT_ENA_S  2
/* SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The enable bit for SPI_DMA_OUTFIFO_EMPTY_ERR_INT interrupt..*/
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ENA    (BIT(1))
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ENA_M  (BIT(1))
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ENA_V  0x1
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ENA_S  1
/* SPI_DMA_INFIFO_FULL_ERR_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The enable bit for SPI_DMA_INFIFO_FULL_ERR_INT interrupt..*/
#define SPI_DMA_INFIFO_FULL_ERR_INT_ENA    (BIT(0))
#define SPI_DMA_INFIFO_FULL_ERR_INT_ENA_M  (BIT(0))
#define SPI_DMA_INFIFO_FULL_ERR_INT_ENA_V  0x1
#define SPI_DMA_INFIFO_FULL_ERR_INT_ENA_S  0

