espressif/esp-idf/components/soc/esp32s3/include/soc/spi_reg.h
#define SPI_DMA_INT_ST_REG(i)          (REG_SPI_BASE(i) + 0x40)
/* SPI_APP1_INT_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: The status bit for SPI_APP1_INT interrupt..*/
#define SPI_APP1_INT_ST    (BIT(20))
#define SPI_APP1_INT_ST_M  (BIT(20))
#define SPI_APP1_INT_ST_V  0x1
#define SPI_APP1_INT_ST_S  20
/* SPI_APP2_INT_ST : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: The status bit for SPI_APP2_INT interrupt..*/
#define SPI_APP2_INT_ST    (BIT(19))
#define SPI_APP2_INT_ST_M  (BIT(19))
#define SPI_APP2_INT_ST_V  0x1
#define SPI_APP2_INT_ST_S  19
/* SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: The status bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt..*/
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ST    (BIT(18))
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ST_M  (BIT(18))
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ST_V  0x1
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ST_S  18
/* SPI_MST_RX_AFIFO_WFULL_ERR_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: The status bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt..*/
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_ST    (BIT(17))
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_ST_M  (BIT(17))
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_ST_V  0x1
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_ST_S  17
/* SPI_SLV_CMD_ERR_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: The status bit for SPI_SLV_CMD_ERR_INT interrupt..*/
#define SPI_SLV_CMD_ERR_INT_ST    (BIT(16))
#define SPI_SLV_CMD_ERR_INT_ST_M  (BIT(16))
#define SPI_SLV_CMD_ERR_INT_ST_V  0x1
#define SPI_SLV_CMD_ERR_INT_ST_S  16
/* SPI_SLV_BUF_ADDR_ERR_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: The status bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt..*/
#define SPI_SLV_BUF_ADDR_ERR_INT_ST    (BIT(15))
#define SPI_SLV_BUF_ADDR_ERR_INT_ST_M  (BIT(15))
#define SPI_SLV_BUF_ADDR_ERR_INT_ST_V  0x1
#define SPI_SLV_BUF_ADDR_ERR_INT_ST_S  15
/* SPI_SEG_MAGIC_ERR_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: The status bit for SPI_SEG_MAGIC_ERR_INT interrupt..*/
#define SPI_SEG_MAGIC_ERR_INT_ST    (BIT(14))
#define SPI_SEG_MAGIC_ERR_INT_ST_M  (BIT(14))
#define SPI_SEG_MAGIC_ERR_INT_ST_V  0x1
#define SPI_SEG_MAGIC_ERR_INT_ST_S  14
/* SPI_DMA_SEG_TRANS_DONE_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The status bit for SPI_DMA_SEG_TRANS_DONE_INT interrupt..*/
#define SPI_DMA_SEG_TRANS_DONE_INT_ST    (BIT(13))
#define SPI_DMA_SEG_TRANS_DONE_INT_ST_M  (BIT(13))
#define SPI_DMA_SEG_TRANS_DONE_INT_ST_V  0x1
#define SPI_DMA_SEG_TRANS_DONE_INT_ST_S  13
/* SPI_TRANS_DONE_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: The status bit for SPI_TRANS_DONE_INT interrupt..*/
#define SPI_TRANS_DONE_INT_ST    (BIT(12))
#define SPI_TRANS_DONE_INT_ST_M  (BIT(12))
#define SPI_TRANS_DONE_INT_ST_V  0x1
#define SPI_TRANS_DONE_INT_ST_S  12
/* SPI_SLV_WR_BUF_DONE_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The status bit for SPI_SLV_WR_BUF_DONE_INT interrupt..*/
#define SPI_SLV_WR_BUF_DONE_INT_ST    (BIT(11))
#define SPI_SLV_WR_BUF_DONE_INT_ST_M  (BIT(11))
#define SPI_SLV_WR_BUF_DONE_INT_ST_V  0x1
#define SPI_SLV_WR_BUF_DONE_INT_ST_S  11
/* SPI_SLV_RD_BUF_DONE_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The status bit for SPI_SLV_RD_BUF_DONE_INT interrupt..*/
#define SPI_SLV_RD_BUF_DONE_INT_ST    (BIT(10))
#define SPI_SLV_RD_BUF_DONE_INT_ST_M  (BIT(10))
#define SPI_SLV_RD_BUF_DONE_INT_ST_V  0x1
#define SPI_SLV_RD_BUF_DONE_INT_ST_S  10
/* SPI_SLV_WR_DMA_DONE_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The status bit for SPI_SLV_WR_DMA_DONE_INT interrupt..*/
#define SPI_SLV_WR_DMA_DONE_INT_ST    (BIT(9))
#define SPI_SLV_WR_DMA_DONE_INT_ST_M  (BIT(9))
#define SPI_SLV_WR_DMA_DONE_INT_ST_V  0x1
#define SPI_SLV_WR_DMA_DONE_INT_ST_S  9
/* SPI_SLV_RD_DMA_DONE_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The status bit for SPI_SLV_RD_DMA_DONE_INT interrupt..*/
#define SPI_SLV_RD_DMA_DONE_INT_ST    (BIT(8))
#define SPI_SLV_RD_DMA_DONE_INT_ST_M  (BIT(8))
#define SPI_SLV_RD_DMA_DONE_INT_ST_V  0x1
#define SPI_SLV_RD_DMA_DONE_INT_ST_S  8
/* SPI_SLV_CMDA_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The status bit for SPI slave CMDA interrupt..*/
#define SPI_SLV_CMDA_INT_ST    (BIT(7))
#define SPI_SLV_CMDA_INT_ST_M  (BIT(7))
#define SPI_SLV_CMDA_INT_ST_V  0x1
#define SPI_SLV_CMDA_INT_ST_S  7
/* SPI_SLV_CMD9_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The status bit for SPI slave CMD9 interrupt..*/
#define SPI_SLV_CMD9_INT_ST    (BIT(6))
#define SPI_SLV_CMD9_INT_ST_M  (BIT(6))
#define SPI_SLV_CMD9_INT_ST_V  0x1
#define SPI_SLV_CMD9_INT_ST_S  6
/* SPI_SLV_CMD8_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The status bit for SPI slave CMD8 interrupt..*/
#define SPI_SLV_CMD8_INT_ST    (BIT(5))
#define SPI_SLV_CMD8_INT_ST_M  (BIT(5))
#define SPI_SLV_CMD8_INT_ST_V  0x1
#define SPI_SLV_CMD8_INT_ST_S  5
/* SPI_SLV_CMD7_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The status bit for SPI slave CMD7 interrupt..*/
#define SPI_SLV_CMD7_INT_ST    (BIT(4))
#define SPI_SLV_CMD7_INT_ST_M  (BIT(4))
#define SPI_SLV_CMD7_INT_ST_V  0x1
#define SPI_SLV_CMD7_INT_ST_S  4
/* SPI_SLV_EN_QPI_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The status bit for SPI slave En_QPI interrupt..*/
#define SPI_SLV_EN_QPI_INT_ST    (BIT(3))
#define SPI_SLV_EN_QPI_INT_ST_M  (BIT(3))
#define SPI_SLV_EN_QPI_INT_ST_V  0x1
#define SPI_SLV_EN_QPI_INT_ST_S  3
/* SPI_SLV_EX_QPI_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The status bit for SPI slave Ex_QPI interrupt..*/
#define SPI_SLV_EX_QPI_INT_ST    (BIT(2))
#define SPI_SLV_EX_QPI_INT_ST_M  (BIT(2))
#define SPI_SLV_EX_QPI_INT_ST_V  0x1
#define SPI_SLV_EX_QPI_INT_ST_S  2
/* SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The status bit for SPI_DMA_OUTFIFO_EMPTY_ERR_INT interrupt..*/
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ST    (BIT(1))
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ST_M  (BIT(1))
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ST_V  0x1
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ST_S  1
/* SPI_DMA_INFIFO_FULL_ERR_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The status bit for SPI_DMA_INFIFO_FULL_ERR_INT interrupt..*/
#define SPI_DMA_INFIFO_FULL_ERR_INT_ST    (BIT(0))
#define SPI_DMA_INFIFO_FULL_ERR_INT_ST_M  (BIT(0))
#define SPI_DMA_INFIFO_FULL_ERR_INT_ST_V  0x1
#define SPI_DMA_INFIFO_FULL_ERR_INT_ST_S  0

